posts/2016-06-22-prayer-for-the-twentytwo.org
#+date: <2016-06-22>
#+filetags: prayer religion army
#+title: Prayer for the Twenty-Two

On average, twenty-two veterans commit suicide every day.

God of peace,

We pray for those who\\
bear the scars of war,\\
both visible and invisible,\\
for wounds that cannot be seen\\
are no less painful to bear,\\
and peace is but a distant dream\\
when the war is within one's own soul.

Give them the courage to speak,\\
and give us to grace to listen.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]] [[file:../tags/army.org][Army]]
#+end_tagline
