docs/posts/2016-06-22-prayer-for-the-twentytwo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Twenty-Two</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Twenty-Two</h1>
<p class="subtitle" role="doc-subtitle">Jun 22, 2016 00:00</p>
</header><p>
On average, twenty-two veterans commit suicide every day.
</p>

<p>
God of peace,
</p>

<p>
We pray for those who<br>
bear the scars of war,<br>
both visible and invisible,<br>
for wounds that cannot be seen<br>
are no less painful to bear,<br>
and peace is but a distant dream<br>
when the war is within one&rsquo;s own soul.
</p>

<p>
Give them the courage to speak,<br>
and give us to grace to listen.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org60a265b">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a> <a href="../tags/army.html">Army</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
